[
    {
      "brandTitle": "BRIGGS & RILEY",
      "subBrandTitle": "San Francisco, CA",
      "articleTitle": "A little bit about Briggs & Riley…",
      "articleContent": "\nBriggs & Riley's parent company is U.S. Luggage LLC. For nearly a century, US Luggage has been bringing innovation to the travel category, including the first wheeled luggage introduced in 1970. Under the leadership of CEO Richard Krulik, Briggs & Riley has become recognized as one of the leading manufacturers in the specialty luggage category, entering the global marketplace in 2006 and now selling in more than 27 countries worldwide.\nCommon sense is a Briggs & Riley mantra, with innovation, thoughtful engineering and performance as cornerstones. This is high quality luggage designed around real world needs with every piece created to make traveling easier and more efficient.\nBriggs & Riley's impact on the industry and insight into consumers' needs goes far beyond design. When founded in 1993, Briggs & Riley revolutionized the travel industry by offering many firsts such as a no questions asked “Simple as that®” lifetime warranty, that even covers damage caused by an airline. This guarantee, like no other in the industry, is a reflection of our commitment to building lifelong relationships with customers and covers every bag that we have ever made, from 1993 through 2015 and beyond.\nEngineering firsts established by Briggs & Riley include the patented Outsider® handle design. With no trolley handle bars inside the bag, travelers get a flat packing area inside the case for more capacity and wrinkle-free clothing. Briggs & Riley also introduced the NXpandable® system, which provided zipper-less one-touch rigid bag expansion as well as the first checkpoint-friendly SpeedThru™ laptop bags in 2008. Briggs & Riley's most recent breakthrough is considered to be the patented CX expansion compression system, allowing bags to expand up to 33% then compress down to original size. In fact, we at Briggs & Riley hold multiple patents designed to make travel simpler.\nIt's Briggs & Riley' legacy of innovative thinking like this - never for innovation's sake - that ultimately sets Briggs & Riley apart.",      "image1": "BriggsRiley/Square1",
      "image2": "BriggsRiley/imgUpper1",
      "image3": "BriggsRiley/imgUpper2",
      "image4": "BriggsRiley/imgUpper3",
      "image5": "BriggsRiley/imgUpper4",
      "image6": "BriggsRiley/Landscape1",
      "image7": "BriggsRiley/Square2",
      "image8": "BriggsRiley/imgLower1",
      "image9": "BriggsRiley/imgLower2",
      "image10": "BriggsRiley/imgLower3",
      "image11": "BriggsRiley/imgLower4",
      "image12": "BriggsRiley/Landscape2",
      
      "video": "https://www.youtube.com/embed/0HxjI9I7Y7I"
    }
      
     
  ]

